//³öÏÖÖØ¸´¶¨Òå£¬gemini¸ÄÓÚ2000.4.3
/*  ÔÚÏàÓ¦µÄperformÀï¼ÓÉÏ£º
   #include "/kungfu/skill/eff_msg.h";
   int p;
    p = (int)target->query("qi")*100/(int)target->query("max_qi");
    msg += damage_msg(damage, "ğöÉË");
    msg += "( $n"+eff_status_msg(p)+" )\n";     
*/

string eff_status_msg(int ratio)
{
        if( ratio>=100 ) return HIG "¿´ÆğÀ´³äÂú»îÁ¦£¬Ò»µãÒ²²»ÀÛ¡£" NOR;
        if( ratio > 90 ) return HIG "ËÆºõÓĞĞ©Æ£±¹£¬µ«ÊÇÈÔÈ»Ê®·ÖÓĞ»îÁ¦¡£" NOR;
        if( ratio > 80 ) return HIY "¿´ÆğÀ´¿ÉÄÜÓĞĞ©ÀÛÁË¡£" NOR;
        if( ratio > 75 ) return HIY "¿´ÆğÀ´¿ÉÄÜÊÜÁËµãÇáÉË¡£" NOR;
        if( ratio > 70 ) return HIY "¶¯×÷ËÆºõ¿ªÊ¼ÓĞµã²»Ì«Áé¹â£¬µ«ÊÇÈÔÈ»ÓĞÌõ²»ÎÉ¡£" NOR;
        if( ratio > 65 ) return HIY "ÊÜÁË¼¸´¦ÉË£¬²»¹ıËÆºõ²¢²»°­ÊÂ¡£" NOR;
        if( ratio > 60 ) return HIY "ÊÜÉË²»Çá£¬¿´ÆğÀ´×´¿ö²¢²»Ì«ºÃ¡£" NOR;
        if( ratio > 50 ) return HIY "Æø´­ĞêĞê£¬¿´ÆğÀ´×´¿ö²¢²»Ì«ºÃ¡£" NOR;
        if( ratio > 45 ) return HIR "ÆøÏ¢´ÖÖØ£¬¶¯×÷¿ªÊ¼É¢ÂÒ£¬¿´À´ËùÊÜµÄÉË×ÅÊµ²»Çá¡£" NOR;
        if( ratio > 40 ) return HIR "ËÆºõÊ®·ÖÆ£±¹£¬¿´À´ĞèÒªºÃºÃĞİÏ¢ÁË¡£" NOR;
        if( ratio > 35 ) return HIR "ÒÑ¾­ÉËºÛÀÛÀÛ£¬ÕıÔÚÃãÁ¦Ö§³Å×Å²»µ¹ÏÂÈ¥¡£" NOR;
        if( ratio > 30 ) return HIR "ÒÑ¾­Ò»¸±Í·ÖØ½ÅÇáµÄÄ£Ñù£¬ÕıÔÚÃãÁ¦Ö§³Å×Å²»µ¹ÏÂÈ¥¡£" NOR;
        if( ratio > 25 ) return HIR "ÊÜÁËÏàµ±ÖØµÄÉË£¬Ö»ÅÂ»áÓĞÉúÃüÎ£ÏÕ¡£" NOR;
        if( ratio > 20 ) return HIR "¿´ÆğÀ´ÒÑ¾­Á¦²»´ÓĞÄÁË¡£" NOR;
        if( ratio > 15 ) return RED "ÉËÖØÖ®ÏÂÒÑ¾­ÄÑÒÔÖ§³Å£¬ÑÛ¿´¾ÍÒªµ¹ÔÚµØÉÏ¡£" NOR;
        if( ratio > 10 ) return RED "Ò¡Í·»ÎÄÔ¡¢ÍáÍáĞ±Ğ±µØÕ¾¶¼Õ¾²»ÎÈ£¬ÑÛ¿´¾ÍÒªµ¹ÔÚµØÉÏ¡£" NOR;
        if( ratio > 5  ) return RED "ÊÜÉË¹ıÖØ£¬ÒÑ¾­ÑÙÑÙÒ»Ï¢£¬ÃüÔÚµ©Ï¦ÁË¡£" NOR;
        if( ratio > 0  ) return RED "ÒÑ¾­ÏİÈë°ë»èÃÔ×´Ì¬£¬ËæÊ±¶¼¿ÉÄÜË¤µ¹ÔÎÈ¥¡£" NOR;        
        return RED "ÊÜÉË¹ıÖØ£¬ÒÑ¾­ÓĞÈç·çÖĞ²ĞÖò£¬ËæÊ±¶¼¿ÉÄÜ¶ÏÆø¡£" NOR;
}

string damage_msg(int damage, string type)
{
        string str;

        if( damage == 0 ) return "½á¹ûÃ»ÓĞÔì³ÉÈÎºÎÉËº¦¡£\n";

        switch( type ) {   
        case "²ÁÉË":
        case "¸îÉË":
                if( damage < 10 ) return "½á¹ûÖ»ÊÇÇáÇáµØ»®ÆÆ$pµÄÆ¤Èâ¡£\n";
                if( damage < 50 ) return "½á¹ûÔÚ$p$l»®³öÒ»µÀÏ¸³¤µÄÑªºÛ¡£\n";
                if( damage < 100 ) return "½á¹û¡¸àÍ¡¹µØÒ»Éù£¬ÔÚ$nÉíÉÏ»®³öÒ»µÀÉË¿Ú£¡\n";
                if( damage < 170 ) return "½á¹û¡¸àÍ¡¹µØÒ»Éù£¬ÔÚ$nÉíÉÏ»®³öÒ»µÀÑªÁÜÁÜµÄÉË¿Ú£¡\n";
                if( damage < 280 ) return "½á¹û¡¸àÍ¡¹µØÒ»Éù£¬ÔÚ$nÉíÉÏ»®³öÒ»µÀÓÖ³¤ÓÖÉîµÄÉË¿Ú£¬½¦µÃ$NÂúÁ³ÏÊÑª£¡\n";
                return "½á¹ûÖ»Ìı¼û$nÒ»Éù²Òº¿£¬$wÒÑÔÚ$p$l»®³öÒ»µÀÉî¼°¼û¹ÇµÄ¿ÉÅÂÉË¿Ú£¡£¡\n";
                break;
        case "´ÌÉË":
                if( damage < 10 ) return "½á¹ûÖ»ÊÇÇáÇáµØ´ÌÆÆ$nµÄÆ¤Èâ¡£\n";
                if( damage < 50 ) return "½á¹ûÔÚ$n$l´Ì³öÒ»¸ö´´¿Ú¡£\n";
                if( damage < 100 ) return "½á¹û¡¸àÛ¡¹µØÒ»Éù´ÌÈëÁË$n$l´çĞí£¡\n";
                if( damage < 170 ) return "½á¹û¡¸àÛ¡¹µØÒ»Éù´Ì½ø$nµÄ$l£¬Ê¹$p²»ÓÉ×ÔÖ÷µØÍËÁË¼¸²½£¡\n";
                if( damage < 280 ) return "½á¹û¡¸àÛàÍ¡¹µØÒ»Éù£¬$wÒÑÔÚ$n$l´Ì³öÒ»¸öÑªÈâÄ£ºıµÄÑª¿ßÁş£¡\n";
                return "½á¹ûÖ»Ìı¼û$nÒ»Éù²Òº¿£¬$wÒÑÔÚ$pµÄ$l¶Ô´©¶ø³ö£¬ÏÊÑª½¦µÃÂúµØ£¡£¡\n";
                break;
        case "ÔÒÉË":
                if( damage < 20 ) return "½á¹ûÖ»ÊÇÇáÇáµØÅö×²µ½ÁË$nÒ»ÏÂ£¬Ã»ÓĞÔì³ÉÊ²Ã´ÉËº¦¡£\n";
                if( damage < 60 ) return "½á¹û$wÖ»½«$nµÄ$lÔÒ³öÒ»¿éğöºì¡£\n";
                if( damage < 120 ) return "½á¹û¡¸Å¾¡¹µØÒ»Éù£¬$w´òÖĞ$nµÄ$l£¬µÇÊ±Ö×ÁËÒ»¿éÀÏ¸ß£¡\n";
                if( damage < 240 ) return "½á¹û$wÖØÖØµÃ»÷ÖĞ$nµÄ$l£¬´òµÃ$pµ¹ÍËÊı²½£¬¡¸ÍÛ¡¹µØÍÂ³öÒ»´ó¿ÚÏÊÑª£¡\n";
                if( damage < 380 ) return "½á¹ûÖ»Ìı¼û¡¸Åğ¡¹µØÒ»Éù¾ŞÏì£¬$w´òÔÚ$nÉíÉÏ£¬½«$pÏñÒ»À¦µ¾²İ°ã»÷·É³öÈ¥£¡\n";
                return "Ö»¼û$wÖØÖØµØ×²»÷ÔÚ$nµÄÉíÉÏ£¬¼¸Éù¹ÇËéÉùÖĞ£¬$pÏóÉ¢ÁË¼ÜËÆµÄÌ±ÁËÏÂÈ¥£¡£¡\n";
                break;
        case "ğöÉË":
                if( damage < 10 ) return "½á¹ûÖ»ÊÇÇáÇáµØÅöµ½£¬±ÈÅÄ²ÔÓ¬ÉÔÎ¢ÖØÁËµã¡£\n";
                if( damage < 20 ) return "½á¹ûÔÚ$pµÄ$lÔì³ÉÒ»´¦ğöÇà¡£\n";
                if( damage < 40 ) return "½á¹ûÒ»»÷ÃüÖĞ£¬$nµÄ$lµÇÊ±Ö×ÁËÒ»¿éÀÏ¸ß£¡\n";
                if( damage < 80 ) return "½á¹ûÒ»»÷ÃüÖĞ£¬$nÃÆºßÁËÒ»ÉùÏÔÈ»³ÔÁË²»Ğ¡µÄ¿÷£¡\n";
                if( damage < 120 ) return "½á¹û¡¸Åé¡¹µØÒ»Éù£¬$nÍËÁËÁ½²½£¡\n";
                if( damage < 200 ) return "½á¹ûÕâÒ»ÏÂ¡¸Åé¡¹µØÒ»Éù´òµÃ$nÁ¬ÍËÁËºÃ¼¸²½£¬²îÒ»µãË¤µ¹£¡\n";
                if( damage < 300 ) return "½á¹ûÖØÖØµØ»÷ÖĞ£¬$n¡¸ÍÛ¡¹µØÒ»ÉùÍÂ³öÒ»¿ÚÏÊÑª£¡\n";
                if( damage < 400 ) return "½á¹ûÖ»Ìı¼û¡¸Åé¡¹µØÒ»Éù¾ŞÏì£¬$nÏñÒ»À¦µ¾²İ°ã·ÉÁË³öÈ¥£¡£¡\n";
                return "Ö»Ìı¼û$nÒ»Éù²Ò½Ğ£¬Õû¸öÉíÌåÏó¶ÏÁËÏßµÄ·çóİÒ»Ñù·ÉÁË³öÈ¥£¡£¡\n";
                break;
        case "ÄÚÉË":
                if( damage < 10 ) return "½á¹ûÖ»ÊÇ°Ñ$n´òµÃÍËÁË°ë²½£¬ºÁ·¢ÎŞËğ¡£\n";
                if( damage < 20 ) return "½á¹û$nÍ´ºßÒ»Éù£¬ÔÚ$pµÄ$lÔì³ÉÒ»´¦ğöÉË¡£\n";
                if( damage < 50 ) return "½á¹ûÒ»»÷ÃüÖĞ£¬°Ñ$n´òµÃÍ´µÃÍäÏÂÑüÈ¥£¡\n";
                if( damage < 100 ) return "½á¹û$nÃÆºßÁËÒ»Éù£¬Á³ÉÏÒ»ÕóÇàÒ»Õó°×£¬ÏÔÈ»ÊÜÁËµãÄÚÉË£¡\n";
                if( damage < 200 ) return "½á¹û$nÁ³É«Ò»ÏÂ±äµÃ²Ò°×£¬»è»è³Á³Á½ÓÁ¬ÍËÁËºÃ¼¸²½£¡\n";
                if( damage < 300 ) return "½á¹ûÖØÖØµØ»÷ÖĞ£¬$n¡¸ÍÛ¡¹µØÒ»ÉùÍÂ³öÒ»¿ÚÏÊÑª£¡\n";
                if( damage < 400 ) return "½á¹û¡¸ºä¡¹µØÒ»Éù£¬$nÈ«ÉíÆøÑªµ¹Á÷£¬¿ÚÖĞÏÊÑª¿ñÅç¶ø³ö£¡\n";
                return "½á¹ûÖ»Ìı¼û¼¸Éù¿¦¿¦ÇáÏì£¬$nÒ»Éù²Ò½Ğ£¬ÏñÌ²ÈíÄà°ãËúÁËÏÂÈ¥£¡£¡\n";
                break;   
        case "ÕğÉË":                
                if( damage < 100 ) return "½á¹û$nÊÜµ½$NµÄÄÚÁ¦·´Õğ£¬ÃÆºßÒ»Éù¡£\n";
                if( damage < 200 ) return "½á¹û$n±»$NÒÔÄÚÁ¦·´Õğ£¬¡¸ºÙ¡¹µØÒ»ÉùÍËÁËÁ½²½¡£\n";
                if( damage < 300 ) return "½á¹û$n±»$NÒÔÄÚÁ¦Ò»Õğ£¬ĞØ¿ÚÓĞÈçÊÜµ½Ò»¼ÇÖØ´¸£¬Á¬ÍËÁËÎåÁù²½£¡\n";
                return "½á¹û$n±»$NµÄÄÚÁ¦Ò»Õğ£¬ÑÛÇ°Ò»ºÚ£¬Éí×ÓÏòºó·É³öÕÉĞí£¡£¡\n";
                break;   
        case "×¥ÉË":     
                if( damage < 10 ) return "½á¹ûÖ»ÊÇÔÚ$n$l´¦ÇáÇá¹Î¹ı£¬Ã»ÓĞÊ²Ã´ÉËº¦¡£\n";
                if( damage < 25 ) return "½á¹û$nÖåÁËÖåÃ¼£¬$pµÄ$lÒÑ¾­±»À­³öÁËÒ»µÀÇ³Ç³µÄÑªºÛ¡£\n";
                if( damage < 50 ) return "½á¹ûÀ­ÏÂÀ´$n$lµÄÒ»µãÆ¤Èâ£¬ÌÛµÃ$p¡¸ÍÛÍÛ¡¹¹Ö½ĞÁËÆğÀ´£¡\n";
                if( damage < 100 ) return "½á¹û¡¸à§¡¹µØÒ»Éù£¬$nµÄ$lÉÏ¶ÙÊ±±»×¥³öÎåµÀÑªºÛ£¬ÏÊÑªÁ÷ÁË³öÀ´£¡\n";
                if( damage < 200 ) return "½á¹û$nÌÛµÃ´ó½ĞÒ»Éù£¬$p$lÉÏ±»×¥³öÁË¼¸µÀÉîÉîµÄÑª¹µ£¬ÏÊÑªÖ±Á÷£¡\n";
                if( damage < 300 ) return "½á¹ûÖ»Ìı¼û$nÒ»Éù²Òº¿£¬$NµÄÊÖ×¥ÒÑÔÚ$pµÄ$l´¦´Ì³öÁËÎå¸öÑªÈâÄ£ºıµÄ¿ßÁş£¡\n";
                if( damage < 400 ) return "½á¹û¡¸°¡¡¹µØÒ»Éù²Ò½Ğ£¬$nÉíÉÏ$p´¦±»$N×¥ÏÂÁËÒ»´óÆ¬Æ¤Èâ£¬ÏÊÑªºá·ÉÂúµØ£¡£¡\n";
                return "½á¹û°éËæ×Å$nÒ»ÉùÆà²ÒµÄº¿½Ğ£¬Ö±Í¸$p$l´¦£¬Á¬Æ¤´øÈâ³¶ÏÂÒ»´ó¿é£¬Â¶³öÁËÑªÁÜÁÜµÄ¹ÇÍ·£¡£¡\n";
                break;       
        default:
                if( !type ) type = "ÉËº¦";
                str =  "½á¹ûÔì³É·Ç³£¿ÉÅÂµÄÑÏÖØ";
                if( damage < 230 ) str = "½á¹ûÔì³É¼«ÆäÑÏÖØµÄ";
                if( damage < 170 ) str = "½á¹ûÔì³ÉÊ®·ÖÑÏÖØµÄ";
                if( damage < 120 ) str = "½á¹ûÔì³ÉÏàµ±ÑÏÖØµÄ";
                if( damage < 80 ) str = "½á¹ûÔì³ÉÆÄÎªÑÏÖØµÄ";
                if( damage < 50 ) str = "½á¹ûÔì³ÉÒ»´¦ÑÏÖØ";
                if( damage < 30 ) str = "½á¹ûÔì³ÉÒ»´¦";
                if( damage < 20 ) str = "½á¹ûÔì³ÉÇáÎ¢µÄ";
                if( damage < 10 ) str =  "½á¹ûÖ»ÊÇÃãÇ¿Ôì³ÉÒ»´¦ÇáÎ¢";
                return str + type + "£¡\n";
        }
}


string *xue_name = ({ 
"ÀÍ¹¬Ñ¨","ëşÖĞÑ¨","Çú³ØÑ¨","¹ØÔªÑ¨","Çú¹ÇÑ¨","ÖĞ¼«Ñ¨","³Ğ½¬Ñ¨","ÌìÍ»Ñ¨","°Ù»áÑ¨",
"ÓÄÃÅÑ¨","ÕÂÃÅÑ¨","´óºáÑ¨","×Ï¹¬Ñ¨","ÀäÔ¨Ñ¨","Ìì¾®Ñ¨","¼«ÈªÑ¨","ÇåÁéÑ¨","ÖÁÑôÑ¨",}); 

//ÊÖÌ«Òõ·Î¾­
string *hand_taiyin_name = ({ "ÉÙÉÌÑ¨","Óã¼ÊÑ¨","Ì«Ô¨Ñ¨","¾­ÇşÑ¨","³ßÔóÑ¨",}); 

//ÊÖÑôÃ÷Ì«³¦¾­
string *hand_yangming_name = ({ "ÉÌÑôÑ¨","¶ş¼äÑ¨","Èı¼äÑ¨","ºÏ¹ÈÑ¨","ÑôÏªÑ¨","Çú³ØÑ¨",}); 

//×ãÌ«ÒõÆ¢¾­
string *foot_taiyin_name = ({ "Òş°×Ñ¨","´ó¶¼Ñ¨","Ì«°×Ñ¨","ÉÌÇğÑ¨","ÑôÁêÈªÑ¨",}); 

//×ãÑôÃ÷Î¸¾­
string *foot_yangming_name = ({ "À÷¶ÒÑ¨","ÄÚÍ¥Ñ¨","Ïİ¹ÈÑ¨","³åÑôÑ¨","½âÏªÑ¨","ÈıÀïÑ¨",}); 

//ÊÖÉÙÒõĞÄ¾­
string *hand_shaoyin_name = ({ "ÉÙ³åÑ¨","ÉÙ¸®Ñ¨","ÉñÃÅÑ¨","ÁéµÀÑ¨","ÉÙº£Ñ¨",}); 

//ÊÖÉÙÑôĞ¡³¦¾­
string *hand_shaoyang_name = ({ "ÉÙÔóÑ¨","Ç°¹ÈÑ¨","ááÏªÑ¨","Íó¹ÇÑ¨","Ñô¹ÈÑ¨","Ğ¡º£Ñ¨",}); 
//×ãÌ«Ñô°òë×¾
string *foot_taiyang_name = ({ "ÖÁÒõÑ¨","Í¨¹ÈÑ¨","Êø¹ÇÑ¨","¾©¹ÇÑ¨","À¥ÂØÑ¨","Î¯ÖĞÑ¨",});
//×ãÉÙÒõÉö¾
string *foot_shaoyin_name = ({ "Ó¿ÈªÑ¨","È»¹ÈÑ¨","Ì«ÏªÑ¨","¸´ÁïÑ¨","Òõ¹ÈÑ¨",});
//ÊÖØÊÒõĞÄ°ü¾
string *hand_queyin_name = ({ "ÖĞ³åÑ¨","ÀÍ¹¬Ñ¨","´óÁêÑ¨","¼äÊ¹Ñ¨","ÇúÔóÑ¨",});
//ÊÖÉÙÑôÈı½¹¾
string *hand_shaoyang_name2 = ({ "¹Ø³åÑ¨","ÒºÃÅÑ¨","ÖĞä¾Ñ¨","Ñô³ØÑ¨","Ö§¹µÑ¨","Ìì¾®Ñ¨",});
//×ãÉÙÑôµ¨¾
string *foot_shaoyang_name = ({ "ÇÏÒõÑ¨","ÏÀÏªÑ¨","ÁÙÆüÑ¨","ÇğĞæÑ¨","Ñô¸¨Ñ¨","ÑôÁêÈªÑ¨",});
//×ãØÊÒõ¸Î¾
string *foot_queyin_name = ({ "´ó¶ØÑ¨","ĞĞ¼äÑ¨","Ì«³åÑ¨","ÖĞ·âÑ¨","ÇúÈªÑ¨",});

 // #include "/kungfu/skill/eff_msg.h";
  // int p;
 //   p = (int)target->query("qi")*100/(int)target->query("max_qi");
  //  msg += damage_msg(damage, "ğöÉË");
  //  msg += "( $n"+eff_status_msg(p)+" )\n";     


string eff_status_msg1(int ratio)
{
        if( ratio>=100 ) return HIG "¿´ÆğÀ´³äÂú»îÁ¦£¬Ò»µãÒ²²»ÀÛ¡£" NOR;
        if( ratio > 90 ) return HIG "ËÆºõÓĞĞ©Æ£±¹£¬µ«ÊÇÈÔÈ»Ê®·ÖÓĞ»îÁ¦¡£" NOR;
        if( ratio > 80 ) return HIY "¿´ÆğÀ´¿ÉÄÜÓĞĞ©ÀÛÁË¡£" NOR;
        if( ratio > 75 ) return HIY "¿´ÆğÀ´¿ÉÄÜÊÜÁËµãÇáÉË¡£" NOR;
        if( ratio > 70 ) return HIY "¶¯×÷ËÆºõ¿ªÊ¼ÓĞµã²»Ì«Áé¹â£¬µ«ÊÇÈÔÈ»ÓĞÌõ²»ÎÉ¡£" NOR;
        if( ratio > 65 ) return HIY "ÊÜÁË¼¸´¦ÉË£¬²»¹ıËÆºõ²¢²»°­ÊÂ¡£" NOR;
        if( ratio > 60 ) return HIY "ÊÜÉË²»Çá£¬¿´ÆğÀ´×´¿ö²¢²»Ì«ºÃ¡£" NOR;
        if( ratio > 50 ) return HIY "Æø´­ĞêĞê£¬¿´ÆğÀ´×´¿ö²¢²»Ì«ºÃ¡£" NOR;
        if( ratio > 45 ) return HIR "ÆøÏ¢´ÖÖØ£¬¶¯×÷¿ªÊ¼É¢ÂÒ£¬¿´À´ËùÊÜµÄÉË×ÅÊµ²»Çá¡£" NOR;
        if( ratio > 40 ) return HIR "ËÆºõÊ®·ÖÆ£±¹£¬¿´À´ĞèÒªºÃºÃĞİÏ¢ÁË¡£" NOR;
        if( ratio > 35 ) return HIR "ÒÑ¾­ÉËºÛÀÛÀÛ£¬ÕıÔÚÃãÁ¦Ö§³Å×Å²»µ¹ÏÂÈ¥¡£" NOR;
        if( ratio > 30 ) return HIR "ÒÑ¾­Ò»¸±Í·ÖØ½ÅÇáµÄÄ£Ñù£¬ÕıÔÚÃãÁ¦Ö§³Å×Å²»µ¹ÏÂÈ¥¡£" NOR;
        if( ratio > 25 ) return HIR "ÊÜÁËÏàµ±ÖØµÄÉË£¬Ö»ÅÂ»áÓĞÉúÃüÎ£ÏÕ¡£" NOR;
        if( ratio > 20 ) return HIR "¿´ÆğÀ´ÒÑ¾­Á¦²»´ÓĞÄÁË¡£" NOR;
        if( ratio > 15 ) return RED "ÉËÖØÖ®ÏÂÒÑ¾­ÄÑÒÔÖ§³Å£¬ÑÛ¿´¾ÍÒªµ¹ÔÚµØÉÏ¡£" NOR;
        if( ratio > 10 ) return RED "Ò¡Í·»ÎÄÔ¡¢ÍáÍáĞ±Ğ±µØÕ¾¶¼Õ¾²»ÎÈ£¬ÑÛ¿´¾ÍÒªµ¹ÔÚµØÉÏ¡£" NOR;
        if( ratio > 5  ) return RED "ÊÜÉË¹ıÖØ£¬ÒÑ¾­ÑÙÑÙÒ»Ï¢£¬ÃüÔÚµ©Ï¦ÁË¡£" NOR;
        if( ratio > 0  ) return RED "ÒÑ¾­ÏİÈë°ë»èÃÔ×´Ì¬£¬ËæÊ±¶¼¿ÉÄÜË¤µ¹ÔÎÈ¥¡£" NOR;        
        return RED "ÊÜÉË¹ıÖØ£¬ÒÑ¾­ÓĞÈç·çÖĞ²ĞÖò£¬ËæÊ±¶¼¿ÉÄÜ¶ÏÆø¡£" NOR;
}

string damage_msg1(int damage, string type)
{
        string str;
        if( damage == 0 ) return "½á¹ûÃ»ÓĞÔì³ÉÈÎºÎÉËº¦¡£\n";

        switch( type ) {       
        case "ğöÉË":
                if( damage < 10 ) return "½á¹ûÖ»ÊÇÇáÇáµØÅöµ½£¬±ÈÅÄ²ÔÓ¬ÉÔÎ¢ÖØÁËµã¡£\n";
                if( damage < 20 ) return "½á¹ûÔÚ$pµÄ$lÔì³ÉÒ»´¦ğöÇà¡£\n";
                if( damage < 40 ) return "½á¹ûÒ»»÷ÃüÖĞ£¬$nµÄ$lµÇÊ±Ö×ÁËÒ»¿éÀÏ¸ß£¡\n";
                if( damage < 80 ) return "½á¹ûÒ»»÷ÃüÖĞ£¬$nÃÆºßÁËÒ»ÉùÏÔÈ»³ÔÁË²»Ğ¡µÄ¿÷£¡\n";
                if( damage < 120 ) return "½á¹û¡¸Åé¡¹µØÒ»Éù£¬$nÍËÁËÁ½²½£¡\n";
                if( damage < 200 ) return "½á¹ûÕâÒ»ÏÂ¡¸Åé¡¹µØÒ»Éù´òµÃ$nÁ¬ÍËÁËºÃ¼¸²½£¬²îÒ»µãË¤µ¹£¡\n";
                if( damage < 300 ) return "½á¹ûÖØÖØµØ»÷ÖĞ£¬$n¡¸ÍÛ¡¹µØÒ»ÉùÍÂ³öÒ»¿ÚÏÊÑª£¡\n";
                if( damage < 400 ) return "½á¹ûÖ»Ìı¼û¡¸Åé¡¹µØÒ»Éù¾ŞÏì£¬$nÏñÒ»À¦µ¾²İ°ã·ÉÁË³öÈ¥£¡£¡\n";
                return "Ö»Ìı¼û$nÒ»Éù²Ò½Ğ£¬Õû¸öÉíÌåÏó¶ÏÁËÏßµÄ·çóİÒ»Ñù·ÉÁË³öÈ¥£¡£¡\n";
                break;
        case "ÄÚÉË":
                if( damage < 10 ) return "½á¹ûÖ»ÊÇ°Ñ$n´òµÃÍËÁË°ë²½£¬ºÁ·¢ÎŞËğ¡£\n";
                if( damage < 20 ) return "½á¹û$nÍ´ºßÒ»Éù£¬ÔÚ$pµÄ$lÔì³ÉÒ»´¦ğöÉË¡£\n";
                if( damage < 50 ) return "½á¹ûÒ»»÷ÃüÖĞ£¬°Ñ$n´òµÃÍ´µÃÍäÏÂÑüÈ¥£¡\n";
                if( damage < 100 ) return "½á¹û$nÃÆºßÁËÒ»Éù£¬Á³ÉÏÒ»ÕóÇàÒ»Õó°×£¬ÏÔÈ»ÊÜÁËµãÄÚÉË£¡\n";
                if( damage < 200 ) return "½á¹û$nÁ³É«Ò»ÏÂ±äµÃ²Ò°×£¬»è»è³Á³Á½ÓÁ¬ÍËÁËºÃ¼¸²½£¡\n";
                if( damage < 300 ) return "½á¹ûÖØÖØµØ»÷ÖĞ£¬$n¡¸ÍÛ¡¹µØÒ»ÉùÍÂ³öÒ»¿ÚÏÊÑª£¡\n";
                if( damage < 400 ) return "½á¹û¡¸ºä¡¹µØÒ»Éù£¬$nÈ«ÉíÆøÑªµ¹Á÷£¬¿ÚÖĞÏÊÑª¿ñÅç¶ø³ö£¡\n";
                return "½á¹ûÖ»Ìı¼û¼¸Éù¿¦¿¦ÇáÏì£¬$nÒ»Éù²Ò½Ğ£¬ÏñÌ²ÈíÄà°ãËúÁËÏÂÈ¥£¡£¡\n";
                break;   
        case "ÕğÉË":                
                if( damage < 100 ) return "½á¹û$nÊÜµ½$NµÄÄÚÁ¦·´Õğ£¬ÃÆºßÒ»Éù¡£\n";
                if( damage < 200 ) return "½á¹û$n±»$NÒÔÄÚÁ¦·´Õğ£¬¡¸ºÙ¡¹µØÒ»ÉùÍËÁËÁ½²½¡£\n";
                if( damage < 300 ) return "½á¹û$n±»$NÒÔÄÚÁ¦Ò»Õğ£¬ĞØ¿ÚÓĞÈçÊÜµ½Ò»¼ÇÖØ´¸£¬Á¬ÍËÁËÎåÁù²½£¡\n";
                return "½á¹û$n±»$NµÄÄÚÁ¦Ò»Õğ£¬ÑÛÇ°Ò»ºÚ£¬Éí×ÓÏòºó·É³öÕÉĞí£¡£¡\n";
                break;   
        case "×¥ÉË":     
                if( damage < 10 ) return "½á¹ûÖ»ÊÇÔÚ$n$l´¦ÇáÇá¹Î¹ı£¬Ã»ÓĞÊ²Ã´ÉËº¦¡£\n";
                if( damage < 25 ) return "½á¹û$nÖåÁËÖåÃ¼£¬$pµÄ$lÒÑ¾­±»À­³öÁËÒ»µÀÇ³Ç³µÄÑªºÛ¡£\n";
                if( damage < 50 ) return "½á¹ûÀ­ÏÂÀ´$n$lµÄÒ»µãÆ¤Èâ£¬ÌÛµÃ$p¡¸ÍÛÍÛ¡¹¹Ö½ĞÁËÆğÀ´£¡\n";
                if( damage < 100 ) return "½á¹û¡¸à§¡¹µØÒ»Éù£¬$nµÄ$lÉÏ¶ÙÊ±±»×¥³öÎåµÀÑªºÛ£¬ÏÊÑªÁ÷ÁË³öÀ´£¡\n";
                if( damage < 200 ) return "½á¹û$nÌÛµÃ´ó½ĞÒ»Éù£¬$p$lÉÏ±»×¥³öÁË¼¸µÀÉîÉîµÄÑª¹µ£¬ÏÊÑªÖ±Á÷£¡\n";
                if( damage < 300 ) return "½á¹ûÖ»Ìı¼û$nÒ»Éù²Òº¿£¬$NµÄÊÖ×¥ÒÑÔÚ$pµÄ$l´¦´Ì³öÁËÎå¸öÑªÈâÄ£ºıµÄ¿ßÁş£¡\n";
                if( damage < 400 ) return "½á¹û¡¸°¡¡¹µØÒ»Éù²Ò½Ğ£¬$nÉíÉÏ$p´¦±»$N×¥ÏÂÁËÒ»´óÆ¬Æ¤Èâ£¬ÏÊÑªºá·ÉÂúµØ£¡£¡\n";
                return "½á¹û°éËæ×Å$nÒ»ÉùÆà²ÒµÄº¿½Ğ£¬Ö±Í¸$p$l´¦£¬Á¬Æ¤´øÈâ³¶ÏÂÒ»´ó¿é£¬Â¶³öÁËÑªÁÜÁÜµÄ¹ÇÍ·£¡£¡\n";
                break;       
       case "´ÌÉË":
               if( damage < 10 ) return "½á¹ûÖ»ÊÇÇáÇáµØ´ÌÆÆ$nµÄÆ¤Èâ¡£\n";
               if( damage < 50 ) return "½á¹ûÔÚ$n$l´Ì³öÒ»¸ö´´¿Ú¡£\n";
               if( damage < 100 ) return "½á¹û¡¸àÛ¡¹µØÒ»Éù´ÌÈëÁË$n$l´çĞí£¡\n";
               if( damage < 170 ) return "½á¹û¡¸àÛ¡¹µØÒ»Éù´Ì½ø$nµÄ$l£¬Ê¹$p²»ÓÉ×ÔÖ÷µØÍËÁË¼¸²½£¡\n";
               if( damage < 280 ) return "½á¹û¡¸àÛàÍ¡¹µØÒ»Éù£¬$wÒÑÔÚ$n$l´Ì³öÒ»¸öÑªÈâÄ£ºıµÄÑª¿ßÁş£¡\n";
               return "½á¹ûÖ»Ìı¼û$nÒ»Éù²Òº¿£¬$wÔÚ$pÉíÉÏ¶Ô´©¶ø³ö£¬ÏÊÑª½¦µÃÂúµØ£¡£¡\n";                
               break;
        default:
                if( !type ) type = "ÉËº¦";
                str =  "½á¹ûÔì³É·Ç³£¿ÉÅÂµÄÑÏÖØ";
                if( damage < 230 ) str = "½á¹ûÔì³É¼«ÆäÑÏÖØµÄ";
                if( damage < 170 ) str = "½á¹ûÔì³ÉÊ®·ÖÑÏÖØµÄ";
                if( damage < 120 ) str = "½á¹ûÔì³ÉÏàµ±ÑÏÖØµÄ";
                if( damage < 80 ) str = "½á¹ûÔì³ÉÆÄÎªÑÏÖØµÄ";
                if( damage < 50 ) str = "½á¹ûÔì³ÉÒ»´¦ÑÏÖØ";
                if( damage < 30 ) str = "½á¹ûÔì³ÉÒ»´¦";
                if( damage < 20 ) str = "½á¹ûÔì³ÉÇáÎ¢µÄ";
                if( damage < 10 ) str =  "½á¹ûÖ»ÊÇÃãÇ¿Ôì³ÉÒ»´¦ÇáÎ¢";
                return str + type + "£¡\n";
        }
}
