// room: /kunlun/ceting_w.c

inherit ROOM;



void create()

{

        set("short", "Î÷²àÌü");

        set("long", @LONG

ÕâÊÇÒ»¸ö°²¾²µÄ²àÌü£¬Ò²ÊÇÕÆÃÅ·òÈË´«ÊÚµÜ×ÓÃÇÎä¹¦µÄµØ·½£¬µ±½ñÕÆÃÅ

·òÈË°àÊçæµÔ­ÊÇÌúÇÙÏÈÉúµÄÊ¦æ¢, Îä¹¦ÒàÔÚ²®ÖÙÖ®¼ä¡£¹Ê´ËÁ½ÈË·Ö±ğÊÕÍ½£

°´ÕÕÌúÇÙÏÈÉúµÄ·Ô¸À, ÊÒÄÚ°Ú·ÅÁË¼¸Åè»¨»Ü, È´¶¼³¤ÊÆ²»ºÃ£¬¸ÇÒò·òÈËÏò

À´²»Ï²»¨²İ, ¼ÒÆÍÒ²¾ÍÀÖµÃ²»È¥ÕÕ¹Ë£¬±±ÃæÓĞÒ»¸öĞ¡·¿¼ä¡££

LONG

        );



        set("exits", ([

                "north" : __DIR__"xlgf_1",

                "west" : __DIR__"dalgf_1",

                "east" : __DIR__"dating",

        ]));



        setup();

        replace_program(ROOM);

}



